<HTML>
<HEAD>
<TITLE>BRLTTY: Anhang</TITLE>
</HEAD>
<BODY>
<A HREF="Manual-ger-3.html">Previous</A>
Next
<A HREF="Manual-ger.html#toc4">Table of Contents</A>
<HR>
<H2><A NAME="s4">4. Anhang</A></H2>

<H2><A NAME="ss4.1">4.1 Verzichterkl&auml;rung und Lizenz</A></H2>

<P>Dieses Programm ist "free software"; Sie k&ouml;nnen es verteilen
und/oder modifizieren, und zwar unter den Bedingungen der <EM>GNU
General Public License</EM> (entweder die Version 2 der Lizenz oder (nach
ihrer Wahl) jede sp&auml;tere Version), wie durch die <EM>Free Software
Foundation</EM> ver&ouml;ffenlicht.</P>
<P>Dieses Programm wird in der Hoffnung verteilt, da&szlig; es sich als n&uuml;tzlich
erweisen wird, aber OHNE JEGLICHE GARANTIE; sogar ohne Folgegarantie
hinsichtlich VERK&Auml;UFLICHKEIT oder GEEIGNETHEIT F&Uuml;R EINEN BESTIMMTEN ZWECK.
F&uuml;r weitere Details s. die <EM>GNU General License</EM>. </P>
<P>Zusammen mit diesem Programm sollten Sie eine Kopie der <EM>GNU
General Public License</EM> erhalten haben; falls nicht, schreiben Sie an
die Free Software Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139,
USA.</P>
<P>(Eine Kopie der GNU General Public License kann man in der Datei
<CODE>COPYING</CODE> im obersten Verzeichnis finden.)</P>


<H2><A NAME="support"></A> <A NAME="ss4.2">4.2 Hilfe und Unterst&uuml;tzung</A></H2>

<P>BRLTTY repr&auml;sentiert die Arbeit eines Teams, das folgende Personen 
einschlie&szlig;t:
<UL>
<LI>
<A HREF="mailto:nico@cam.org">Nicolas Pitre&lt;nico@cam.org&gt;</A> (derzeitiger Instandhalter);</LI>
<LI>
<A HREF="mailto:s.doyon@videotron.ca">St&eacute;phane Doyon &lt;s.doyon@videotron.ca&gt;</A> (aktiver Entwickler);</LI>
<LI> 
<A HREF="mailto:nn201@cus.cam.ac.uk">Nikhil Nair     &lt;nn201@cus.cam.ac.uk&gt;</A> (original Autor, nicht mehr aktive);</LI>
<LI>
<A HREF="mailto:jrbowden@bcs.org.uk">James Bowden &lt;jrbowden@bcs.org.uk&gt;</A>(jetzt in beratender Funktion 
t&auml;tig).</LI>
</UL>
</P>
<P>Kommentare und Kritik sind willkommen. Wir werden versuchen, schnell
auf alle (vern&uuml;nftige) Post zu antworten, geben aber keine
Garantie. Im allgemeinen, so meinen wir, sollten Sie Email-Botschaften
eher an alle aktiven Entwickler senden.</P>
<P>Falls Sie eine Anfrage zu einer bestimmten Anzeigeart, die durch BRLTTY
unterst&uuml;tzt wird, haben, wollen Sie vielleicht den Autor dieses besonderen
Treibers kontaktieren. S. die <CODE>README</CODE>-Datei im entsprechenden Unterverzeichnis f&uuml;r Kontaktdetails.</P>


<H2><A NAME="ss4.3">4.3 BRLTTY auf Installations- und Rettungsdisketten</A></H2>

<P>Von der Version 1.0.1 kann BRLTTY als unabh&auml;ngig ausf&uuml;hrbares
Programm laufen, also ohne jede Konfigurationsdatei. In diesem Fall
werden die bei der &Uuml;bersetzung festgelegten Standardwerte verwendet
werden. Falls das Verzeichnis <CODE>/etc/brltty</CODE> nicht existiert
(ben&uuml;tzt, um die Konfigurationsdatei, die Online-Hilfsdatei und die
Tabellendateien zu speichern), sucht BRLTTY in <CODE>/etc</CODE> nach der
Hilfsdatei <CODE>brlttydev.hlp</CODE> und der Konfigurationsdatei
<CODE>brlttyconf.dat</CODE>. Auch wenn diese nicht exis tieren, wird BRLTTY
noch immer funktionieren!</P>
<P>Anmerkung: Die Datei /dev/vcsa ist ebenfalls notwendig. Sie sollte
bereits existieren, au&szlig;er bei sehr alten Linux Distributionen. Sie
k&ouml;nnen sie aber selbst erzeugen 
<BLOCKQUOTE><CODE>
<PRE>
 
mknod /dev/vcsa0 c 7 128 
chown root.tty /dev/vcsa0 
chmod 660 /dev/vcsa0 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Wenn man Floppy Rootdisks f&uuml;r Installations- oder Rettungszwecke baut, ist
Raum oft das Wesentliche.  Diese neue Elastizit&auml;t erlaubt es, BRLTTY  als
einzeln ausf&uuml;hrbares Programm auf solchen Disketten zu installieren,
wodurch die Raumanforderung herabgesetzt wird.</P>
<P>Beachten Sie: Das Script <CODE>install-brltty</CODE> nimmt an, da&szlig; eine
vollst&auml;ndige Installation von BRLTTY kopiert werden mu&szlig;.</P>
<P>Ein Problem, da&szlig; beim Einsatz von BRLTTY unter "unbekannten" Umst&auml;nden
wie z.B. auf einer Boot Diskette oder in einem unvollst&auml;ndigen System,
oft auftritt, ist die Verf&uuml;gbarkeit der f&uuml;r BRLTTY notwendigen
Bibliotheken. Boot Disketten verwenden oft kleinere oder &auml;ltere
Versionen der Bibliothek die nicht ausreichend sind. Die L&ouml;sung
besteht in der &Uuml;bersetzung mit der Option <CODE>-static</CODE> im
Makefile. Damit werden alle Abh&auml;ngigkeiten von Bibliotheken beseitigt,
leider ist das entstehende ausf&uuml;hrbare Programm gr&ouml;&szlig;er.</P>


<H2><A NAME="ss4.4">4.4 Zuk&uuml;nftige Erweiterungen</A></H2>

<P>Abgesehen von Fehlerkorrekturen und der Unterst&uuml;tzung weiterer
Braille-Anzeigen, hoffen wir, Zeit vorausgesetzt, an einigen oder
allen der folgenden Punkte weiterzuarbeiten:</P>
<P>
<DL>
<DT><B>Bessere Attributbehandlung</B><DD><P>Attributverfolgung, gemischter Text-
und Attributmodus etc.</P>

<DT><B>Neugestaltung von Ausschneiden und Einf&uuml;gen</B><DD><P>(cut &amp; paste) Linearer
Ausschneidemodus (im Gegensatz zum Ausschneiden von Rechtecken).</P>

<DT><B>Neugestaltung der Tonausgabe</B><DD><P>Eine gr&ouml;&szlig;ere Variation von T&ouml;nen.</P>

<DT><B>Scrollverfolgung</B><DD><P>Einsperren des Braille-Fensters auf einer
Zeile, sowie sie auf dem Schirm entlangwandert.</P>

<DT><B>Elementare Sprachunterst&uuml;tzung</B><DD><P>Gemischte Brailleschrift und
Sprachausgabe zum schnelleren Lesen des Texts</P>

<DT><B>On-the-fly grade II &Uuml;bersetzung</B><DD><P>Auch das w&uuml;rde ein schnelleres Lesen
des Texts erlauben.</P>
</DL>
</P>
<P>In der Datei TODO finden Sie eine vollst&auml;ndigere Liste.</P>


<H2><A NAME="ss4.5">4.5 Bekannte Fehler</A></H2>

<P>Diese Software wurde getestet auf
<UL>
<LI>einer Anzahl von PCs: sowohl auf Laptops als auch Desktops; 
Prozessoren von 386SX20  bis Pentium mit verschiedensten
Speichergr&ouml;&szlig;en;  Linux Distributionen einschlie&szlig;lich 
Debian, Slackware, Red Hat und SuSE;  einer Anzahl von Linux kernels, 
einschlie&szlig;lich 1.2.13, 2.0.0 und 2.0.34.</LI>
<LI>einem DEC Alpha: nur einmal getestet, unter RedHat Alpha Linux auf 
einem "noname board", freundlicherweise geliehen dem Cambridge 
University Computer Laboratory von DEC in Reading, England.</LI>
</UL>
</P>
<P>Sie hat sich bis jetzt als stabil erwiesen, aber falls sie nicht auf Ihrem
System ist oder falls Sie einen Fehler finden, der hier nicht erw&auml;hnt ist,
lassen Sie uns das bitte wissen, soda&szlig; wir versuchen k&ouml;nnen, das Problem
zu l&ouml;sen.</P>
<P>Derzeit (26 July 1998) sind folgende Problem bekannt:
<DL>
<DT><B>Cursor routing Performace</B><DD><P>Routing ist durch eine Schleife in
einen Subproze&szlig;, der mit niedriger Priorit&auml;t l&auml;uft,
implementiert. Dadurch wird ein zu hoher Zeitverbaruch
vermieden. Verschiedene Systembelastung erfordert aber eine andere
Einstellung der Parameter. Der Standardwert arbeit in einem
Standardeditor in einem System mit niedriger Last sehr gut, aber
unter anderen Umst&auml;nden, z.B. bei einer langsamen seriellen
Verbindung sind die Ergebnisse schlecht.</P>

<DT><B>Verwendung mit DOS Emu</B><DD><P>Die Simulation von Tastatureingaben
funktioniert nicht mit DOSEmus "raw" Tastaturmodus. In diesem Fall
m&uuml;&szlig;te die Simulation der Tasteneingabe auf eine andere Art geschehen,
m&ouml;glicherweise durch Scancodes. Dies beeinflu&szlig;t das Cursor Routing
und die Cut &amp; Paste Funktion.</P>
</DL>
</P>


<HR>
<A HREF="Manual-ger-3.html">Previous</A>
Next
<A HREF="Manual-ger.html#toc4">Table of Contents</A>
</BODY>
</HTML>
